#                          #                              اضافة مدخلات
#
# print(9)
# print(10/2)
# name = input("entr your name :")
# ege = input("entr your age :")
# print("haloo "+ name)
# print("your age :" +ege)
# _______________________________________________________________________________________
#                         جمع المدخلات ك text وليس ك رقم

#
# nambar = input ("entr your farst nambar :")
# nambr2 = input("iner your scand namber : ")
# man = nambar+nambr2
# print(man)
# -----------------------------------------------------------------------------------------
#                                         جمع مدخلا ك ارقام اينتجر
#
# nambr = input("intr your nambr : ") #كتابه متغير وفتح امر اينبوت ثم نكتب السؤال للمستخدم
# nambr2 = input("intr your nambr : ") #-----------------------------------------------
# lo = int (nambr)+int (nambr2) # نضع قيمه ثم نجمع المتغيرات مع وضع امر اينت قبل كل متغير لجمع قيم كلا المتغيرين ك ارقام
# print(lo) # امر طباعه المتغير الذي جمعنا به المتغيرات
# --------------------------------------------------------------------------------------------
#  عوده ...
#                                 بناء اله حاسبه

#
#     case '-':opration=input("select the operation")
# print(type(opration))
# first_num=input("pleass enter first numer : ")
# secandNum=input("pleass enter scnde numer : ")
# output=0
# match  opration :
#     case '+':
#             output = int(first_num) + int(secandNu
#             output = int(first_num) - int(secandNum)
#     case '*':
#             output = int(first_num) * int(secandNum)
#
#     case '/':
#             output = int(first_num) / int(secandNum)
#     case _:
#         print("error opration")
# print(output)
# __________________________________________________________________________________________________________________
#                                               جمع الارقام ك ارقام و فواصل عشرية

# __________________________________________________________________________________________________________________
#                            جمع المدخلات ك ارقام صحيحة وغير صحيحه

# nambr = input("intr your nambr : ")      # المتغير والقيمه بداخل الاينبوت
# nambr2 = input("intr your nambr : ")     #..............................
# lo = float (nambr)+float (nambr2)         # جمع المتغيرين مع  وضع امر فلوت قبل كل متغير
# print(lo)                   #..............
# ____________________________________________________________________________________________________________________
#                                              بناء اول لعب
# your_name = input("your name : ")
# your_age = input("your age : ")
# your_email= input("your email : ")
# print("your name : " +your_name)
# print("your email : " + your_email)
# print("your age : " + your_age)
# ______________________________________________________________________________________________________________________
#                                                     القوائم
#
# frind = [1,"vgsgsg",True,False,]  # اضافة اكثر من قيمه سواء كتابه او ارقام
# frind[3] = "yazan"  # تعديل على القيمه المطلوبة ومع ذكر ترتيبها
# print((frind[2]))   # طباعة قيمة محدده من داخل المتغير مع ذكر رقم ترتيبها
# print(frind[-3])    #
# print((frind[1:3]))
# print(frind[1:])
# print(frind[3])
#______________________________________________________________________________________________________________________
#                                               القوائم الجزء الثاني
#
# codsels = ["paython","html","css","yzn",]
# jame = ["wael","ahmad","mohmad"]
# codsels.append("aslam")
# print(codsels)
# اعاده ---------------------------------
#
# ti =["yzn","wael","ahmde"]
# ui =["saebar","scuorty"]
# ti.append("yazana")    #       اضافة اي كلمه للمتغير ti
# ti.extend(ui)          # جمع قيم المتغيرين ti و ui مع بعض
# ti.insert(2, "ans")   # وضع اي كلمه قبل القيمه المحدده في المتغير ووضع رقم ترتيب الجملة والبايثون يبدا بالعد من رقم 0
# ti.remove("yzn")    #حذف اي كلمه
# # ti.clear()     # الغاء الكود ب اكمله
# wats_pop = ti.pop()  # حذف اخر قيمة من المتغير الذي اخترته وتخزينها في متغير اذا اردت
# print(ti)                   # طباعه الكود
# print(wats_pop) # طباعة المتغير الذي بداخله يتم تخزين اخر قيمة محذوفه
# print(ti.index("ahmde"))     # البحث عن اي جملة داخل الكود ان كانت موجوده ام لا
#----------------------------------------------------------------------------------------
# case '-':opration=input("select the operation")
#
# opration=input("enter the opration")
#
# print(type(opration))      # التايب هي نوع
# first_num=input("pleass enter first numer : ")
# secandNum=input("pleass enter scnde numer : ")
# output=0
# match  opration :         # الماتش هي حلقه وصل بين المتغير اوبريشن و الكيس
#     case '+':               # ا
#             output = int(first_num) + int(secandNum)
#             output = int(first_num) - int(secandNum)
#     case '*':
#             output = int(first_num) * int(secandNum)
#
#     case '/':
#             output = int(first_num) / int(secandNum)
#     case __:
#         print("error opration")
# print(output)
#
# ==================================================================#
# popo = ["yazan" "ahmad" "ali" "ali" "ahmad"]
# print (popo.count("ahmad"))     # تستخدم كاونت لمعرفة كم عدد قيمه محدده داخل المتغير
#============================اعاده
#
# cnm =["tito" "ans"]
# cnm.sort()                      # ترتيب الجمل حسب الاحرف
# print(cnm)
# =====================================================================
# # اعاده
# pi =[4,6,2,1,3,5]
# pi.sort()
# print(pi)

#=================================
#
# list_new = sms.copy()
# sms = ["yahoo","gmail","hotmail"]           # عمل نسخه من قيم المتغير دون التاثير عليها في حال تم اضافه تعديل
# sms.append(1)
# print(list_new)
# print(sms)
# ==================================================================================
#
# on =(3,2,1,4,)
# print(on[1])                                           #لطباعه قيمه معينه من داخل المتغير حسب ترتيبها
# ========================================================================================================
#                                                             الدوال
#
# def say_hi(): # Functions                                     #    امر ديف هو فتخ داله ثم نضع متغير ثم
#     print("HALOO")
# print("ZOOM")
# print("Titl")
# say_hi()
# =================================================================================================================
#
# def yzn():
#     print("jordan")
# yzn()
# =============================================================#
#
# print("welcoom \n to jordan")             #          وضيفتها جعل الجمله على سطرين في حال وضعتها بمنتصف الجمله   \n
#
# print("welcoom \"  to ejbt")              # وضيفه ال \n وضع فاصله بين الجمله
#
# print("welcom\t to eraq")                 # وضع مسافه بين الجمله
#######################################################################################################################
#
# def oia(name):
#     print("haloo "+ name)
# oia("yazan")
#
#=======================================================اعاده===================================
#
# def popo(name):
#     print("haloo " +name)
# popo("yzn")
# ------------------------------p\
#
# oi= "YAZAN ALQAWASMI"
# print(oi.lower())       #تستخدم الوور لجعل كل الحروف صغيره
# ===============================================================
#
# po = "yazan srhan"
# print(po.upper())             # تستخدم ابر لجعل الحروف كبيره عكس لور
# ==================================================================================
#
# of = "mahmod srhan"
# print(of.isupper())            #تستخدم لنرى اذا كانت الجمله حروفها كبيرة او لا النتيجه تروو او فيلس
#==========================================================================================
# mn = "yazan"
# print(mn.lower().isupper())               #
# -----------------------
#
# mn = "yazan alqawasmi"
# print(len(mn))        # تستخدم len لمعرفه عدد الاحرف بالمتغير
# ============================================
#
# ml = "yazan alqawasmi"
# print(ml[0])                          # لعرفه ماهو اول حرف
# ------------------------------
#
# mc = "yazan alqawasmi"
# print(mc.index("a"))                # لبحث عن حرف ما ان كان موجود واضهار ترتيبه
# --------------------------
#
# mp = "yazan alqawasmi"
# print(mp.replace("yazan","khliil"))                            #هنا لتبديل كلمه من النص واستبدالها باخرا
# الجمله التي تريد استبدالها بها  \ الجمله الماخوذه من النص

# =====================================================الدوال =====================================================
#
# def your_name(name):
#     print("your name is " +name)
# your_name("yazan")
# ------------------------------------------------------------

# def haloo(name):
#     print("haloo " +name)
# haloo("yazan")
# # ---------------
# po = input("name : ")
# print("haloo " + po)
# po=[2,3,1,7,8,]
#--------------------------------------------------------------------------------
#
# text = "haloo woord"
# print (text.capitalize())   # تستخدم كبتلز لكي تجل اول حرف كبير (كبيتل لتر)
# ------------------------------------------
#
# kj = "HALLO WORD"
# print(kj.casefold())               # تستخدم كيس فولد لجعل جميع الاحرف كبيتل لتر
# ------------------------S
#
# kj = "HALLO WORD"
# print(kj.count("H"))              # عدد المرات المكررة لهذه الحرف
# =====================
#
# kj = "HALLO WORD"
# print(kj.index("H"))              # البحث عن حرف من داخل القيم
# ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
#
# kj = "HALLO WORD"
# print(kj.endswith("r"))    # للبحث اذا كانت اخر الجملة تنتهي بهذه الحرف ام لا النتيجه تروو او فيلس
# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#
# kj = "HALLO WORD"
# print(kj.find("L"))                # يعرض لك الحرف الذي تبحث عنه وترتيبه والفرق بينه وبين اينبوكس ان اينبوكس يعطي خطا بينما فيند يعطي -1
# xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
#
# kj = "HALLO WORD"
# print(kj.lstrip())               #   يحذف الفراغات من ناحيه اليسار
# ====================
#
# kj = "HALLO WORD       "
# print(kj.rstrip())                  #يحذف القراغات من ناحيه اليمين
# -----------------------------------------
#
# kj = "HALLO WORD"
# print(kj.replace ("HALOO","WELCOOM"))   # لاستبدال جمله ب اخرى
# # ===================
#
# kj = "HALLO WORD"
# print(kj.rfind("HALLO WORD"))             # اعاده تمركز
# \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
#
# kj = "HALLO WORD"
# print(kj.find("HALLO WORD"))
# |||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||\\\
#
# kj = "haloo word"
# print(kj.title())            # جعل اول حرف من اول جمله
# 0000000000000000000000000000000000000000000000000000000
#
# kj = "haloo word"
# print(kj.rfind("HALLO WORD"))
# =================================
#
# kj = "haloo word"
# print(kj.swapcase())       #  جعل جميع الاحرف كابيتل لتر (كبيرة)
# (0)(0)(0)(0)(0)(0)(0)(0)(0)(0)(0)(0)(0)(0)(0)(0)(0)(0)(0)(0)(0)(0)(0)(0)(0)(0)(0)(0)(0)(0)
#
# kj = "haloo word"
# print(len(kj))
# 000000000000000000000000000000000000000000000000000000
#
# kj = "010101010010101"
# print (kj.isalnum())       # تاكد ان كل القيم داخل المتغير ارقام ولا يوجد اي حرف ابجدي
# ]}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}
#
# kj = "يزن"
# print(kj.isalpha())   # تستخدم للتاكد اذا كانت جميع الاحرف عربيه خاليه من الارقام او اي حروف اخرى غير العربيه
# +++++++++++++++++++++++++++++++++++++++++++++++++++
#
# kj = "7473829"
# print(kj.isdecimal())      # للتاكد ان جميع الاحرف في المتغير عبارة عن ارقام خاليه من الفواصل العشريه والاحرف الابجديه
# ################################################################
#
# kj = "hash"
# print(kj.isidentifier())    # تستخدم لنرى اذا كان يصلح للتسم ان يكون متغير او لا لانه الارقام لا تصلح ان تكون متغير بل قيم
# ***************************************************
#
# kj = "haloo word"
# print(kj.islower())     #تستخدم لنرى اذا كان هنالك احرف صغيرة او لا
# 0@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
#
# kj = "HALOO WORD"
# print(kj.isupper())  # للتاكد اذا كان كل الاحرف كبيرة
# 00000000000000000000000000000000000000000000000000000
#
# kj = "haloo word"
# print(kj.isnumeric())    #لنرى اذا كان جميع القيم ارقتم خاليه الاحرف والفواصل العشريه
#
# kj = "Yazan"
# print(kj.istitle())    # لنرى اذا مان اول حرف كبير او لا

# =====================================================الدوال =====================================================
#
# def your_name(name):
#     print("your name is " +name)
# your_name("yazan")
# ------------------------------------------------------------
#000000000000000000000
#
# def yzn ():
#     print("yazan")
# yzn()
# 88888888888888888
#
# def ui (name) :
#     print("haloo " +name)
# ui("yazan")
# --------------------------------
# #
# def cube(num):
#     return num*num*num                 # ارجاع قيمه من الداله
# me = cube(3)
# print(me)
# ---------------------
#
# def po (num):                                          #
#     return num*num*num                                 #
# print(cube(8))                                         #      طريقه ثانيه
# ==============
#
# def ol(num1,num2):
#     return num1+num2              # وضع متغيرين وجمع قيمهم
# print(ol(1,2))
# ---------------------------
